Revit 2026 API

# ParameterFilterUtilitiesGetFilterableParametersInCommon Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ICollection<ElementId> GetFilterableParametersInCommon(
	Document aDoc,
	ICollection<ElementId> categories
)
```
```vb
Public Shared Function GetFilterableParametersInCommon (
	aDoc As Document,
	categories As ICollection(Of ElementId)
) As ICollection(Of ElementId)
```
```cpp
public:
static ICollection<ElementId^>^ GetFilterableParametersInCommon(
	Document^ aDoc,
	ICollection<ElementId^>^ categories
)
```
```fsharp
static member GetFilterableParametersInCommon :
        aDoc : Document *
        categories : ICollection<ElementId> -> ICollection<ElementId>
```

#### Parameters

aDoc Document

categories ICollectionElementId

#### Return Value

ICollectionElementId

#### Reference

ParameterFilterUtilities Class

Autodesk.Revit.DB Namespace